# RunType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsType..::..RunType Property
StairsType Class See Also
---
The type for all runs in the stair element.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId RunType { get; set; }
```

Visual Basic
---
```text
Public Property RunType As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ RunType {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The specified runTypeId is not a valid run type. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
StairsType Class
Autodesk.Revit.DB.Architecture Namespace